Revit 2027 API
RadioButtonGroup.Current Property
Gets or sets the current checked ToggleButton of the RadioButtonGroup.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ToggleButton Current { get; set; }
Public Property Current As ToggleButton
	Get
	Set
public:
property ToggleButton^ Current {
	ToggleButton^ get ();
	void set (ToggleButton^ value);
}
member Current : ToggleButton with get, set
Property Value
ToggleButton
Exceptions
Exception | Condition
ArgumentNullException | Thrown when trying to set this property to null.
ArgumentException | Thrown when trying to set this property to a button not in this group.
Remarks
 The default value is the first ToggleButton added to the group. When using this property to set the current ToggleButton, the external command of that button will not be called.
See Also
Reference
RadioButtonGroup Class
Autodesk.Revit.UI Namespace